<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Part&nbsp;I.&nbsp;&#49436;&#47928;</title><link rel="stylesheet" type="text/css" href="css/manual-multipage.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Spring Security &#47112;&#54140;&#47088;&#49828;"><link rel="up" href="index.html" title="Spring Security &#47112;&#54140;&#47088;&#49828;"><link rel="prev" href="pr01.html" title=""><link rel="next" href="getting-started.html" title="Part&nbsp;II.&nbsp;&#49884;&#51089;&#54616;&#44592;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Part&nbsp;I.&nbsp;&#49436;&#47928;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="pr01.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="getting-started.html">Next</a></td></tr></table><hr></div><div class="part"><div class="titlepage"><div><div><h1 class="title"><a name="preface" href="#preface"></a>Part&nbsp;I.&nbsp;&#49436;&#47928;</h1></div></div></div>

<div class="partintro"><div></div>
<p>Spring Security&#45716; Java EE &#44592;&#48152;&#51032; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#50948;&#54620; &#53685;&#54633; &#48372;&#50504; &#49556;&#47336;&#49496;&#51012; &#51228;&#44277;&#54620;&#45796;. &#48376; &#47112;&#54140;&#47088;&#49828; &#44032;&#51060;&#46300;&#47484; &#51069;&#51004;&#47728; &#48156;&#44204;&#54616;&#44192;&#51648;&#47564;, &#50976;&#50857;&#54620; &#48372;&#50504; &#49884;&#49828;&#53596;&#51012; &#51228;&#44277;&#54616;&#44592; &#50948;&#54644; &#45432;&#47141;&#54664;&#45796;.</p>
<p>&#48372;&#50504;&#50640; &#45824;&#54644;&#49436;&#45716; &#54252;&#44292;&#51201;&#51060;&#44256; &#49884;&#49828;&#53596; &#51204;&#48152;&#50640; &#44152;&#52828; &#51217;&#44540;&#51060; &#51473;&#50836;&#54616;&#45796;. Security Circles&#50640;&#49436;&#45716; &#8220;&#44228;&#52789;&#51201; &#48372;&#50504;(layers of security)&#8221;&#51012; &#51201;&#50857;&#54632;&#51004;&#47196;&#50024; &#44033;&#44033;&#51032; &#44228;&#52789;&#51060; &#48372;&#50504;&#51012; &#52293;&#51076;&#51656; &#49104; &#47564; &#50500;&#45768;&#46972;, &#50672;&#49549;&#51201;&#51064; &#44228;&#52789;&#46308;&#51060; &#52628;&#44032;&#51201;&#51004;&#47196; &#48372;&#50504; &#54616;&#46020;&#47197; &#54616;&#45716; &#48169;&#48277;&#51012; &#44428;&#44256;&#54620;&#45796;. &#44033; &#44228;&#52789;&#51032; &#48372;&#50504;&#51060; &#8220;&#45908; &#52504;&#52504;&#8221;&#54624;&#49688;&#47197;, &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#45908; &#44204;&#44256;&#54616;&#44256; &#50504;&#51204;&#54624; &#44163;&#51060;&#45796;. &#54616;&#50948; &#47112;&#48296;&#50640;&#49436;&#45716; &#51473;&#44036;&#51088; &#44277;&#44201;&#51012; &#48169;&#51648;&#54616;&#44592; &#50948;&#54644; transport security&#50752; system identification&#44284; &#44057;&#51008; &#51060;&#49800;&#47484; &#45796;&#47364;&#50556;&#54620;&#45796;. &#44536; &#45796;&#51020;&#51004;&#47196;&#45716; VPN&#51060;&#45208; IP security&#50752; &#54632;&#44760; &#48169;&#54868;&#48317;&#51012; &#51060;&#50857;&#54616;&#50668; &#44428;&#54620;&#51060; &#51080;&#45716; &#49884;&#49828;&#53596;&#47564; &#50672;&#44208;&#51012; &#49884;&#46020;&#54624; &#49688; &#51080;&#46020;&#47197; &#47564;&#46308;&#50612;&#50556; &#54620;&#45796;. &#44592;&#50629; &#54872;&#44221;&#50640;&#49436;&#45716; &#44277;&#50857; &#49436;&#48260;&#47484; &#46263;&#45800;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#47196;&#48512;&#53552; &#48516;&#47532;&#54616;&#44592; &#50948;&#54644; DMZ&#47484; &#48176;&#52824;&#54616;&#44592;&#46020; &#54620;&#45796;. &#50868;&#50689;&#52404;&#51228; &#50669;&#49884; &#51473;&#50836;&#54620; &#50669;&#54624;&#51012; &#49688;&#54665;&#54616;&#45716;&#45936;, &#54028;&#51068; &#49884;&#49828;&#53596; &#48372;&#50504;&#51012; &#52572;&#45824;&#54868;&#54616;&#44256; &#44428;&#54620; &#50630;&#45716; &#49324;&#50857;&#51088;&#47484; &#50948;&#54620; &#48324;&#46020; &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665;&#54616;&#45716; &#46321;&#51032; &#51060;&#49800;&#47484; &#52376;&#47532;&#54620;&#45796;. &#51068;&#48152;&#51201;&#51004;&#47196; &#50868;&#50689; &#52404;&#51228;&#45716; &#51088;&#52404;&#51201;&#51064; &#48169;&#54868;&#48317;&#51012; &#44396;&#49457;&#54616;&#44256; &#51080;&#45796;. &#49436;&#48708;&#49828; &#44144;&#48512; &#44277;&#44201;(DoS)&#51060;&#45208; &#49884;&#49828;&#53596;&#50640; &#45824;&#54620; brute force &#44277;&#44201;&#51012; &#47561;&#50500;&#50556; &#54624; &#51068;&#51060; &#49373;&#44600; &#49688;&#46020; &#51080;&#45796;. &#52840;&#51077; &#44048;&#51648; &#49884;&#49828;&#53596;&#51008; &#51060;&#47084;&#54620; &#44277;&#44201;&#51012; &#47784;&#45768;&#53552;&#47553;&#54616;&#45716;&#45936;&#50640; &#50976;&#50857;&#54616;&#45796;. &#49892;&#49884;&#44036;&#51004;&#47196; &#49688;&#49345;&#54620; TCP/IP &#51452;&#49548;&#47484; &#47561;&#45716; &#46321;&#51032; &#48169;&#50612; &#50529;&#49496;&#51012; &#52712;&#54624; &#49688; &#51080;&#44592; &#46412;&#47928;&#51060;&#45796;. &#51060;&#51228; &#49345;&#50948; &#47112;&#48296;&#51012; &#48372;&#47732;, &#45817;&#49888;&#51032; JVM&#51008; &#49345;&#51060;&#54620; Java &#53440;&#51077;&#50640; &#45824;&#54644;&#49436; &#52572;&#49548;&#54620;&#51032; &#44428;&#54620;&#51012; &#51452;&#46020;&#47197; &#49444;&#51221;&#46104;&#50612;&#51080;&#44256;, &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#50669;&#49884; domain-specific &#48372;&#50504; &#49444;&#51221;&#51012; &#44033;&#44033; &#44032;&#51648;&#44256; &#51080;&#45796;. Spring Security&#45716; &#51060; &#54980;&#51088; &#48512;&#48516; -&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#48372;&#50504;- &#51012; &#55016;&#50476; &#49789;&#44172; &#47564;&#46308;&#50612;&#51456;&#45796;.</p>
<p>&#47932;&#47200; &#50948;&#50640;&#49436; &#50616;&#44553;&#54620; &#48372;&#50504; &#44228;&#52789;&#46308;&#51008; &#47784;&#46304; &#44228;&#52789;&#51012; &#50500;&#50864;&#47484;&#49688; &#51080;&#45716; &#50836;&#49548;&#46308;&#44284; &#54632;&#44760; &#51201;&#51208;&#55176; &#45796;&#47364;&#50556; &#54620;&#45796;. &#44536;&#47084;&#54620; &#50836;&#49548;&#50640;&#45716; security bulletin monitoring, patching, personnel vetting, audits, change control, engineering management systems, data backup, disaster recovery, performance benchmarking, load monitoring, centralised logging, incident response procedures &#46321;&#51060; &#51080;&#45796;.</p>
<p>Spring Security&#47196; &#45796;&#47344; &#49688; &#51080;&#45716; &#50836;&#44396;&#49324;&#54637;&#46308;&#51008; &#48708;&#51648;&#45768;&#49828; &#50689;&#50669;&#51060; &#45796;&#50577;&#54620; &#44163;&#47564;&#53372;&#51060;&#45208; &#47566;&#45796;. &#48197;&#53433; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#54596;&#50836;&#54620; &#50836;&#44396;&#49324;&#54637;&#44284; &#51060;&#52964;&#47672;&#49828; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#50836;&#44396;&#49324;&#54637;&#51060; &#45796;&#47476;&#44256;, &#51060;&#52964;&#47672;&#49828; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#54596;&#50836;&#54620; &#50836;&#44396;&#49324;&#54637;&#44284; &#44592;&#50629;&#50857; &#49464;&#51068;&#51592; &#54252;&#49828; &#51088;&#46041;&#54868; &#53812;&#50640;&#49436; &#54596;&#50836;&#54620; &#44163;&#44284;&#45716; &#46608; &#45796;&#47476;&#45796;. &#51060;&#47084;&#54620; &#45796;&#50577;&#54620; &#50836;&#44396;&#49324;&#54637;&#51060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#48372;&#50504;&#51012; &#55141;&#48120;&#47213;&#44256;, &#46020;&#51204;&#51201;&#51060;&#44256;, &#48372;&#46988;&#51080;&#44172; &#47564;&#46304;&#45796;.</p>
<p><a class="xref" href="getting-started.html" title="Part&nbsp;II.&nbsp;&#49884;&#51089;&#54616;&#44592;">Part&nbsp;II, &#8220;&#49884;&#51089;&#54616;&#44592;&#8221;</a>&#50640;&#45716; &#48736;&#47476;&#44172; &#49884;&#51089;&#54624; &#49688; &#51080;&#46020;&#47197; &#54532;&#47112;&#51076;&#50892;&#53356;&#50752; namespace &#44592;&#48152;&#51032; &#49444;&#51221; &#49884;&#49828;&#53596;&#50640; &#45824;&#54616;&#50668; &#49444;&#47749;&#54620;&#45796;. Spring Security&#51032; &#51089;&#46041; &#48169;&#49885;&#44284; &#49324;&#50857;&#54616;&#45716; &#53364;&#47000;&#49828;&#46308;&#51012;  &#45908; &#51096; &#51060;&#54644;&#54616;&#44256; &#49910;&#45796;&#47732;, <a class="xref" href="overall-architecture.html" title="Part&nbsp;III.&nbsp;Architecture and Implementation">Part&nbsp;III, &#8220;Architecture and Implementation&#8221;</a>&#47484; &#51069;&#51004;&#47732; &#46108;&#45796;. &#51060; &#44032;&#51060;&#46300;&#51032; &#45208;&#47672;&#51648; &#54028;&#53944;&#45716; &#54596;&#50836;&#54620; &#48512;&#48516;&#51012; &#49440;&#53469;&#51201;&#51004;&#47196; &#51069;&#51012; &#49688; &#51080;&#46020;&#47197; &#51204;&#53685;&#51201;&#51064; &#48169;&#49885;&#51004;&#47196; &#44396;&#49457;&#46104;&#50612;&#51080;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#48372;&#50504; &#47928;&#51228;&#50752; &#44288;&#47144;&#46108; &#51204;&#48152;&#51012; &#44032;&#45733;&#54620; &#54620; &#47566;&#51060; &#51069;&#45716; &#44163; &#46608;&#54620; &#52628;&#52380;&#54616;&#45716; &#48148;&#51060;&#45796;. Spring Security&#44032; &#47784;&#46304; &#48372;&#50504; &#47928;&#51228;&#47484; &#54644;&#44208;&#54624; &#49688; &#51080;&#45716; &#47564;&#48337; &#53685;&#52824;&#50557;&#51008; &#50500;&#45768;&#45796;. &#51473;&#50836;&#54620; &#44163;&#51008;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#44228;&#48512;&#53552; &#48372;&#50504; &#47928;&#51228;&#47484; &#49373;&#44033;&#54616;&#44256; &#51080;&#45716; &#44163;&#51060;&#45796;. &#45208;&#51473;&#50640; &#48372;&#50504;&#51012; &#45180;&#50892;&#45347;&#51004;&#47140;&#44256; &#54616;&#45716; &#44163;&#51008; &#51339;&#51648; &#50506;&#51008; &#49373;&#44033;&#51060;&#45796;. &#53945;&#55176; &#50937; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#47564;&#46308;&#44256; &#51080;&#45796;&#47732;, cross-site scripting, request-forgery, session-hijacking&#44057;&#51008; &#51104;&#51116;&#51201;&#51064; &#52712;&#50557;&#49457;&#50640; &#45824;&#54644; &#52376;&#51020;&#48512;&#53552; &#44256;&#47140;&#54644;&#50556;&#54620;&#45796;. OWASP &#50937;&#49324;&#51060;&#53944;(<a class="ulink" href="http://www.owasp.org/)%EB%8A%94" target="_top">http://www.owasp.org/)&#45716;</a> &#50976;&#50857;&#54620; &#47112;&#54140;&#47088;&#49828; &#51221;&#48372;&#50752; &#54632;&#44760; &#50937;&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#52712;&#50557;&#51216; &#49345;&#50948; 10&#44060;&#51032; &#47532;&#49828;&#53944;&#47484; &#51648;&#49549;&#51201;&#51004;&#47196; &#44081;&#49888;&#54644;&#49436; &#48372;&#50668;&#51456;&#45796;.</p>
<p>&#51060; &#44032;&#51060;&#46300;&#44032; &#50976;&#50857;&#54616;&#44600; &#48148;&#46972;&#47728;, &#50616;&#51228;&#45208; &#54588;&#46300;&#48177;&#50640; &#50676;&#47140;&#51080;&#45796; <a class="link" href="community.html#jira" title="6.1&nbsp;Issue Tracking">suggestions</a>.</p>
<p>&#46300;&#46356;&#50612;, Spring Security&#51032; &#49464;&#44228;&#50640; &#50728; &#44163;&#51012; &#54872;&#50689;&#54620;&#45796; <a class="link" href="community.html" title="6.&nbsp;Spring Security Community">community</a>.</p>
</div>
</div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="pr01.html">Prev</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="getting-started.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Part&nbsp;II.&nbsp;&#49884;&#51089;&#54616;&#44592;</td></tr></table></div></body></html>